espressif/esp-idf/components/soc/esp32c5/include/soc/lp_io_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: configure_register */
/** Type of out_data register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_out_data : R/W/WTC; bitpos: [7:0]; default: 0;
         *  set lp gpio output data
         */
        uint32_t lp_gpio_out_data:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_out_data_reg_t;

/** Type of out_data_w1ts register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_out_data_w1ts : WT; bitpos: [7:0]; default: 0;
         *  set one time output data
         */
        uint32_t lp_gpio_out_data_w1ts:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_out_data_w1ts_reg_t;

/** Type of out_data_w1tc register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_out_data_w1tc : WT; bitpos: [7:0]; default: 0;
         *  clear one time output data
         */
        uint32_t lp_gpio_out_data_w1tc:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_out_data_w1tc_reg_t;

/** Type of out_enable register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_enable : R/W/WTC; bitpos: [7:0]; default: 0;
         *  set lp gpio output data
         */
        uint32_t lp_gpio_enable:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_out_enable_reg_t;

/** Type of out_enable_w1ts register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_enable_w1ts : WT; bitpos: [7:0]; default: 0;
         *  set one time output data
         */
        uint32_t lp_gpio_enable_w1ts:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_out_enable_w1ts_reg_t;

/** Type of out_enable_w1tc register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_enable_w1tc : WT; bitpos: [7:0]; default: 0;
         *  clear one time output data
         */
        uint32_t lp_gpio_enable_w1tc:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_out_enable_w1tc_reg_t;

/** Type of status register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_status_interrupt : R/W/WTC; bitpos: [7:0]; default: 0;
         *  set lp gpio output data
         */
        uint32_t lp_gpio_status_interrupt:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_status_reg_t;

/** Type of status_w1ts register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_status_w1ts : WT; bitpos: [7:0]; default: 0;
         *  set one time output data
         */
        uint32_t lp_gpio_status_w1ts:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_status_w1ts_reg_t;

/** Type of status_w1tc register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_status_w1tc : WT; bitpos: [7:0]; default: 0;
         *  clear one time output data
         */
        uint32_t lp_gpio_status_w1tc:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_status_w1tc_reg_t;

/** Type of in register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio_in_data_next : RO; bitpos: [7:0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio_in_data_next:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_in_reg_t;

/** Type of pin0 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio0_sync_bypass : R/W; bitpos: [1:0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_sync_bypass:2;
        /** lp_gpio0_pad_driver : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_pad_driver:1;
        /** lp_gpio0_edge_wakeup_clr : WT; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_edge_wakeup_clr:1;
        uint32_t reserved_4:3;
        /** lp_gpio0_int_type : R/W; bitpos: [9:7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_int_type:3;
        /** lp_gpio0_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_wakeup_enable:1;
        /** lp_gpio0_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_io_pin0_reg_t;

/** Type of pin1 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio1_sync_bypass : R/W; bitpos: [1:0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_sync_bypass:2;
        /** lp_gpio1_pad_driver : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_pad_driver:1;
        /** lp_gpio1_edge_wakeup_clr : WT; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_edge_wakeup_clr:1;
        uint32_t reserved_4:3;
        /** lp_gpio1_int_type : R/W; bitpos: [9:7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_int_type:3;
        /** lp_gpio1_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_wakeup_enable:1;
        /** lp_gpio1_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_io_pin1_reg_t;

/** Type of pin2 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio2_sync_bypass : R/W; bitpos: [1:0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_sync_bypass:2;
        /** lp_gpio2_pad_driver : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_pad_driver:1;
        /** lp_gpio2_edge_wakeup_clr : WT; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_edge_wakeup_clr:1;
        uint32_t reserved_4:3;
        /** lp_gpio2_int_type : R/W; bitpos: [9:7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_int_type:3;
        /** lp_gpio2_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_wakeup_enable:1;
        /** lp_gpio2_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_io_pin2_reg_t;

