espressif/esp-idf/components/soc/esp32c5/include/soc/lp_io_struct.h
/** Type of pin3 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio3_sync_bypass : R/W; bitpos: [1:0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_sync_bypass:2;
        /** lp_gpio3_pad_driver : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_pad_driver:1;
        /** lp_gpio3_edge_wakeup_clr : WT; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_edge_wakeup_clr:1;
        uint32_t reserved_4:3;
        /** lp_gpio3_int_type : R/W; bitpos: [9:7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_int_type:3;
        /** lp_gpio3_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_wakeup_enable:1;
        /** lp_gpio3_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_io_pin3_reg_t;

/** Type of pin4 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio4_sync_bypass : R/W; bitpos: [1:0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_sync_bypass:2;
        /** lp_gpio4_pad_driver : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_pad_driver:1;
        /** lp_gpio4_edge_wakeup_clr : WT; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_edge_wakeup_clr:1;
        uint32_t reserved_4:3;
        /** lp_gpio4_int_type : R/W; bitpos: [9:7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_int_type:3;
        /** lp_gpio4_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_wakeup_enable:1;
        /** lp_gpio4_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_io_pin4_reg_t;

/** Type of pin5 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio5_sync_bypass : R/W; bitpos: [1:0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_sync_bypass:2;
        /** lp_gpio5_pad_driver : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_pad_driver:1;
        /** lp_gpio5_edge_wakeup_clr : WT; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_edge_wakeup_clr:1;
        uint32_t reserved_4:3;
        /** lp_gpio5_int_type : R/W; bitpos: [9:7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_int_type:3;
        /** lp_gpio5_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_wakeup_enable:1;
        /** lp_gpio5_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_io_pin5_reg_t;

/** Type of pin6 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio6_sync_bypass : R/W; bitpos: [1:0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_sync_bypass:2;
        /** lp_gpio6_pad_driver : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_pad_driver:1;
        /** lp_gpio6_edge_wakeup_clr : WT; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_edge_wakeup_clr:1;
        uint32_t reserved_4:3;
        /** lp_gpio6_int_type : R/W; bitpos: [9:7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_int_type:3;
        /** lp_gpio6_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_wakeup_enable:1;
        /** lp_gpio6_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_io_pin6_reg_t;

/** Type of pin7 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio7_sync_bypass : R/W; bitpos: [1:0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_sync_bypass:2;
        /** lp_gpio7_pad_driver : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_pad_driver:1;
        /** lp_gpio7_edge_wakeup_clr : WT; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_edge_wakeup_clr:1;
        uint32_t reserved_4:3;
        /** lp_gpio7_int_type : R/W; bitpos: [9:7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_int_type:3;
        /** lp_gpio7_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_wakeup_enable:1;
        /** lp_gpio7_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_io_pin7_reg_t;

/** Type of gpio0 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio0_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_mcu_oe:1;
        /** lp_gpio0_slp_sel : R/W; bitpos: [1]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_slp_sel:1;
        /** lp_gpio0_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_mcu_wpd:1;
        /** lp_gpio0_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_mcu_wpu:1;
        /** lp_gpio0_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_mcu_ie:1;
        /** lp_gpio0_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_mcu_drv:2;
        /** lp_gpio0_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_fun_wpd:1;
        /** lp_gpio0_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_fun_wpu:1;
        /** lp_gpio0_fun_ie : R/W; bitpos: [9]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_fun_ie:1;
        /** lp_gpio0_fun_drv : R/W; bitpos: [11:10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_fun_drv:2;
        /** lp_gpio0_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  need des
         */
        uint32_t lp_gpio0_mcu_sel:3;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} lp_io_gpio0_reg_t;

/** Type of gpio1 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio1_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_mcu_oe:1;
        /** lp_gpio1_slp_sel : R/W; bitpos: [1]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_slp_sel:1;
        /** lp_gpio1_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_mcu_wpd:1;
        /** lp_gpio1_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_mcu_wpu:1;
        /** lp_gpio1_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_mcu_ie:1;
        /** lp_gpio1_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_mcu_drv:2;
        /** lp_gpio1_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_fun_wpd:1;
        /** lp_gpio1_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_fun_wpu:1;
        /** lp_gpio1_fun_ie : R/W; bitpos: [9]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_fun_ie:1;
        /** lp_gpio1_fun_drv : R/W; bitpos: [11:10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_fun_drv:2;
        /** lp_gpio1_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  need des
         */
        uint32_t lp_gpio1_mcu_sel:3;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} lp_io_gpio1_reg_t;

/** Type of gpio2 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio2_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_mcu_oe:1;
        /** lp_gpio2_slp_sel : R/W; bitpos: [1]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_slp_sel:1;
        /** lp_gpio2_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_mcu_wpd:1;
        /** lp_gpio2_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_mcu_wpu:1;
        /** lp_gpio2_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_mcu_ie:1;
        /** lp_gpio2_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_mcu_drv:2;
        /** lp_gpio2_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_fun_wpd:1;
        /** lp_gpio2_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_fun_wpu:1;
        /** lp_gpio2_fun_ie : R/W; bitpos: [9]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_fun_ie:1;
        /** lp_gpio2_fun_drv : R/W; bitpos: [11:10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_fun_drv:2;
        /** lp_gpio2_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  need des
         */
        uint32_t lp_gpio2_mcu_sel:3;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} lp_io_gpio2_reg_t;

