espressif/esp-idf/components/soc/esp32c5/include/soc/lp_io_struct.h
/** Type of gpio3 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio3_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_mcu_oe:1;
        /** lp_gpio3_slp_sel : R/W; bitpos: [1]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_slp_sel:1;
        /** lp_gpio3_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_mcu_wpd:1;
        /** lp_gpio3_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_mcu_wpu:1;
        /** lp_gpio3_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_mcu_ie:1;
        /** lp_gpio3_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_mcu_drv:2;
        /** lp_gpio3_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_fun_wpd:1;
        /** lp_gpio3_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_fun_wpu:1;
        /** lp_gpio3_fun_ie : R/W; bitpos: [9]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_fun_ie:1;
        /** lp_gpio3_fun_drv : R/W; bitpos: [11:10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_fun_drv:2;
        /** lp_gpio3_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  need des
         */
        uint32_t lp_gpio3_mcu_sel:3;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} lp_io_gpio3_reg_t;

/** Type of gpio4 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio4_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_mcu_oe:1;
        /** lp_gpio4_slp_sel : R/W; bitpos: [1]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_slp_sel:1;
        /** lp_gpio4_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_mcu_wpd:1;
        /** lp_gpio4_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_mcu_wpu:1;
        /** lp_gpio4_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_mcu_ie:1;
        /** lp_gpio4_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_mcu_drv:2;
        /** lp_gpio4_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_fun_wpd:1;
        /** lp_gpio4_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_fun_wpu:1;
        /** lp_gpio4_fun_ie : R/W; bitpos: [9]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_fun_ie:1;
        /** lp_gpio4_fun_drv : R/W; bitpos: [11:10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_fun_drv:2;
        /** lp_gpio4_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  need des
         */
        uint32_t lp_gpio4_mcu_sel:3;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} lp_io_gpio4_reg_t;

/** Type of gpio5 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio5_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_mcu_oe:1;
        /** lp_gpio5_slp_sel : R/W; bitpos: [1]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_slp_sel:1;
        /** lp_gpio5_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_mcu_wpd:1;
        /** lp_gpio5_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_mcu_wpu:1;
        /** lp_gpio5_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_mcu_ie:1;
        /** lp_gpio5_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_mcu_drv:2;
        /** lp_gpio5_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_fun_wpd:1;
        /** lp_gpio5_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_fun_wpu:1;
        /** lp_gpio5_fun_ie : R/W; bitpos: [9]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_fun_ie:1;
        /** lp_gpio5_fun_drv : R/W; bitpos: [11:10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_fun_drv:2;
        /** lp_gpio5_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  need des
         */
        uint32_t lp_gpio5_mcu_sel:3;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} lp_io_gpio5_reg_t;

/** Type of gpio6 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio6_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_mcu_oe:1;
        /** lp_gpio6_slp_sel : R/W; bitpos: [1]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_slp_sel:1;
        /** lp_gpio6_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_mcu_wpd:1;
        /** lp_gpio6_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_mcu_wpu:1;
        /** lp_gpio6_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_mcu_ie:1;
        /** lp_gpio6_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_mcu_drv:2;
        /** lp_gpio6_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_fun_wpd:1;
        /** lp_gpio6_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_fun_wpu:1;
        /** lp_gpio6_fun_ie : R/W; bitpos: [9]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_fun_ie:1;
        /** lp_gpio6_fun_drv : R/W; bitpos: [11:10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_fun_drv:2;
        /** lp_gpio6_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  need des
         */
        uint32_t lp_gpio6_mcu_sel:3;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} lp_io_gpio6_reg_t;

/** Type of gpio7 register
 *  need des
 */
typedef union {
    struct {
        /** lp_gpio7_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_mcu_oe:1;
        /** lp_gpio7_slp_sel : R/W; bitpos: [1]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_slp_sel:1;
        /** lp_gpio7_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_mcu_wpd:1;
        /** lp_gpio7_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_mcu_wpu:1;
        /** lp_gpio7_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_mcu_ie:1;
        /** lp_gpio7_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_mcu_drv:2;
        /** lp_gpio7_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_fun_wpd:1;
        /** lp_gpio7_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_fun_wpu:1;
        /** lp_gpio7_fun_ie : R/W; bitpos: [9]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_fun_ie:1;
        /** lp_gpio7_fun_drv : R/W; bitpos: [11:10]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_fun_drv:2;
        /** lp_gpio7_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  need des
         */
        uint32_t lp_gpio7_mcu_sel:3;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} lp_io_gpio7_reg_t;

