espressif/esp-idf/components/soc/esp32c5/include/soc/lp_io_struct.h
/** Type of status_interrupt register
 *  need des
 */
typedef union {
    struct {
        /** status_interrupt_next : RO; bitpos: [7:0]; default: 0;
         *  need des
         */
        uint32_t status_interrupt_next:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_io_status_interrupt_reg_t;

/** Type of debug_sel0 register
 *  need des
 */
typedef union {
    struct {
        /** lp_debug_sel0 : R/W; bitpos: [6:0]; default: 0;
         *  need des
         */
        uint32_t lp_debug_sel0:7;
        /** lp_debug_sel1 : R/W; bitpos: [13:7]; default: 0;
         *  need des
         */
        uint32_t lp_debug_sel1:7;
        /** lp_debug_sel2 : R/W; bitpos: [20:14]; default: 0;
         *  need des
         */
        uint32_t lp_debug_sel2:7;
        /** lp_debug_sel3 : R/W; bitpos: [27:21]; default: 0;
         *  need des
         */
        uint32_t lp_debug_sel3:7;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lp_io_debug_sel0_reg_t;

/** Type of debug_sel1 register
 *  need des
 */
typedef union {
    struct {
        /** lp_debug_sel4 : R/W; bitpos: [6:0]; default: 0;
         *  need des
         */
        uint32_t lp_debug_sel4:7;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} lp_io_debug_sel1_reg_t;

/** Type of lpi2c register
 *  need des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** lp_i2c_sda_ie : R/W; bitpos: [30]; default: 1;
         *  need des
         */
        uint32_t lp_i2c_sda_ie:1;
        /** lp_i2c_scl_ie : R/W; bitpos: [31]; default: 1;
         *  need des
         */
        uint32_t lp_i2c_scl_ie:1;
    };
    uint32_t val;
} lp_io_lpi2c_reg_t;

/** Type of date register
 *  need des
 */
typedef union {
    struct {
        /** lp_io_date : R/W; bitpos: [30:0]; default: 35660032;
         *  need des
         */
        uint32_t lp_io_date:31;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  need des
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} lp_io_date_reg_t;


typedef struct {
    volatile lp_io_out_data_reg_t out_data;
    volatile lp_io_out_data_w1ts_reg_t out_data_w1ts;
    volatile lp_io_out_data_w1tc_reg_t out_data_w1tc;
    volatile lp_io_out_enable_reg_t out_enable;
    volatile lp_io_out_enable_w1ts_reg_t out_enable_w1ts;
    volatile lp_io_out_enable_w1tc_reg_t out_enable_w1tc;
    volatile lp_io_status_reg_t status;
    volatile lp_io_status_w1ts_reg_t status_w1ts;
    volatile lp_io_status_w1tc_reg_t status_w1tc;
    volatile lp_io_in_reg_t in;
    volatile lp_io_pin0_reg_t pin0;
    volatile lp_io_pin1_reg_t pin1;
    volatile lp_io_pin2_reg_t pin2;
    volatile lp_io_pin3_reg_t pin3;
    volatile lp_io_pin4_reg_t pin4;
    volatile lp_io_pin5_reg_t pin5;
    volatile lp_io_pin6_reg_t pin6;
    volatile lp_io_pin7_reg_t pin7;
    volatile lp_io_gpio0_reg_t gpio0;
    volatile lp_io_gpio1_reg_t gpio1;
    volatile lp_io_gpio2_reg_t gpio2;
    volatile lp_io_gpio3_reg_t gpio3;
    volatile lp_io_gpio4_reg_t gpio4;
    volatile lp_io_gpio5_reg_t gpio5;
    volatile lp_io_gpio6_reg_t gpio6;
    volatile lp_io_gpio7_reg_t gpio7;
    volatile lp_io_status_interrupt_reg_t status_interrupt;
    volatile lp_io_debug_sel0_reg_t debug_sel0;
    volatile lp_io_debug_sel1_reg_t debug_sel1;
    volatile lp_io_lpi2c_reg_t lpi2c;
    uint32_t reserved_078[225];
    volatile lp_io_date_reg_t date;
} lp_io_dev_t;

extern lp_io_dev_t LP_IO;

#ifndef __cplusplus
_Static_assert(sizeof(lp_io_dev_t) == 0x400, "Invalid size of lp_io_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
